//Добавьте класс вольера, в котором живут животные и который описывается следующим функционалом:
//    Параметры;
//-Название
//- Биом
//- Площадь

//Функциональность:
//-Может содержать в себе различных животных
//        -Можно подселить животное
//        -Можно отселить животное
//        -Можно покормить животных (еда "насыпается" в вольер сразу всем, а не конкретному животному)
//        -Можно узнать сколько и какой еды осталось в кормушках
//        -Можно узнать кто не наелся, сколько и какой еды им нужно
//        -Можно попросить всех животных издать звук

//    Правила расселения:
//        -Животное можно поселить только в вольер, который соответствует его биому и в котором достаточно свободного места.
//        -Хищники могут жить только с представителями того же вида.
//        -Травоядные могут жить с любыми травоядными

namespace Animals
{
	public class Aviary
	{
		public Aviary()
		{
		}
	}
}

