// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

//Оформите класс, методы которого будут решать задачи, приведенные ниже.

//Важно: Названия методов должны отображать суть а не номер)

//1) Метод получает на вход 3 числа (A, B и С). Верните решение(значение X) линейного уравнения стандартного вида, где A*X+B=C.

//2) Метод получает на вход 2 числа (A и B). Если A больше B, подсчитать A+B, если A равно B, подсчитать A*B, если A меньше B, подсчитать A-B.

//3) Метод получает на вход двузначное число. Верните прописную запись этого числа. Например при вводе “25” в консоль будет выведено “двадцать пять”.

//4) Метод получает на вход число. Проверить попадает ли оно в один из диапазонов: от 0 до 10, от 20 до 30 или от 40 до 50. *Здесь хорошим вариантом будет вернуть true или false.

//5) Метод получает на вход 2 числа (A и B). Верните сумму всех чисел из диапазона от A до B, которые делятся на 7.

//6) Метод получает на вход положительное число (N). Верните N-ое число ряда Фибоначчи.

//7) Метод получает на вход число. Найти количество нечетных цифр этого числа.

//8) Метод получает на вход число. Найти число, которое является зеркальным

//9) Метод получает на вход 2 числа. Сообщите, есть ли в написании двух чисел одинаковые цифры. Например, для пары 123 и 345, ответом будет являться true, а, для пары 500 и 999 - false.